{"pageProps":{"postMetadata":{"title":"Go Gotchas, Tips, and Good Practices for Efficient Go","description":"Review some of the common mistakes we make while writing Go code and learn how to avoid them along with good practices for efficient Go.","imgName":"go-gotchas-and-good-practices/go-gotchas-and-good-practices.jpg","date":"Mar 25, 2024","tags":["go"],"keywords":["go","golang","go-gotchas","go-good-practices","go-best-practices","go-tips","efficient-go"],"id":"go-gotchas-and-good-practices"},"postContent":{"compiledSource":"var p=Object.defineProperty,m=Object.defineProperties;var d=Object.getOwnPropertyDescriptors;var r=Object.getOwnPropertySymbols;var o=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var c=(e,t,a)=>t in e?p(e,t,{enumerable:!0,configurable:!0,writable:!0,value:a}):e[t]=a,n=(e,t)=>{for(var a in t||(t={}))o.call(t,a)&&c(e,a,t[a]);if(r)for(var a of r(t))s.call(t,a)&&c(e,a,t[a]);return e},l=(e,t)=>m(e,d(t));var h=(e,t)=>{var a={};for(var i in e)o.call(e,i)&&t.indexOf(i)<0&&(a[i]=e[i]);if(e!=null&&r)for(var i of r(e))t.indexOf(i)<0&&s.call(e,i)&&(a[i]=e[i]);return a};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(a){var i=a,{components:e}=i,t=h(i,[\"components\"]);return mdx(MDXLayout,l(n(n({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,mdx(\"img\",n({parentName:\"p\"},{src:\"go-gotchas-and-good-practices/go-gotchas-and-good-practices.jpg\",alt:\"Go Gotchas and Good Practices\"}))),mdx(\"h6\",null,\"Published on: \",mdx(\"strong\",{parentName:\"h6\"},\"Mar 25, 2024\")),mdx(\"h1\",null,\"Go Gotchas, Tips, and Good Practices for Efficient Go\"),mdx(\"p\",null,\"Even though Go is a very simple language and we can avoid most of the issues/errors at compilation time because of static typing, lint checks, data race checks, and other analysis checks, we still tend to make some common mistakes.\"),mdx(\"p\",null,\"In this article, we will review some of the common mistakes/gotchas the new Go developers make and some not-common mistakes even the experienced Go developers cannot avoid if they don't pay attention. And we will also see some good practices while writing Go code to make it more efficient.\"),mdx(\"h3\",null,\"Declaration inside a block in a local-scope\"),mdx(\"p\",null,\"Variables declared inside a block like \",mdx(\"em\",{parentName:\"p\"},\"if-else/for\"),\" are local scope variables. If you have declared any variable outside of the block and re-declared the variable with the same name and changed it inside the block, after you try to access it thinking the values as changed but it's not the case in Go (maybe in Python). But in Go, it's a bug. This is one of the most common mistakes that many new Go developers make \"),mdx(\"pre\",null,mdx(\"code\",n({parentName:\"pre\"},{className:\"language-go\"}),`func main() {\n    arr := []int{4, -2, 23, 10}\n    var v int\n\n    for _, v := range arr {\n        if v >= 10 {\n            break\n        }\n    }\n\n    fmt.Println(\"found value >=10:\", v) // prints v as '0'\n}\n`)),mdx(\"p\",null,\"Now, remove the declaration in the for-loop for \",mdx(\"em\",{parentName:\"p\"},\"i\"),\" and print\"),mdx(\"pre\",null,mdx(\"code\",n({parentName:\"pre\"},{className:\"language-go\"}),`func main() {\n    arr := []int{4, -2, 23, 10}\n    var v int\n\n    for _, v = range arr {\n        if v >= 10 {\n            break\n        }\n    }\n\n    fmt.Println(\"found value >=10:\", v) // prints v as '23'\n}\n`)),mdx(\"h3\",null,\"Pointers in place of values\"),mdx(\"p\",null,\"Pointers are everywhere in Go. We can pass variables as values and also as pointers (reference only) to the functions. If the function is passed a pointer, there is a chance that it can modify the value of the pointer leading to an unprecedented situation. The function may pass the value to any other function where it can also change value and a chain of value changes make the program state undesirable. Even if you want to have this behavior like the value of the variable to be changed in the called function, it violates the principle of \",mdx(\"strong\",{parentName:\"p\"},\"Function invariance\"),\". Instead, use struct and change members of the struct when needed.\"),mdx(\"h3\",null,\"General data structures are not good for concurrent access\"),mdx(\"p\",null,\"Normal data structures like int, slices, and maps are not safe for concurrent access by multiple goroutines. We may have to put locks or such mechanisms for safe access, without those proper synchronization mechanisms, we might face into data race situation.\"),mdx(\"p\",null,\"There exist atomic level operations to perform on primitive data types like int with \",mdx(\"em\",{parentName:\"p\"},\"sync/atomic\"),\" package, and also \",mdx(\"em\",{parentName:\"p\"},\"sync.Map\"),\" for concurrent access of Map elements.\"),mdx(\"h3\",null,\"Splitting an empty string will give a slice of length 1\"),mdx(\"p\",null,\"If the string is empty, and we split it, we expect the length of the resultant array to be \",mdx(\"strong\",{parentName:\"p\"},\"0\"),\". But, in Go, we will get the length as \",mdx(\"strong\",{parentName:\"p\"},\"1\"),\" and the first element is the empty string. This is strange in Go so keep in mind while splitting and it's always good to check the string length before splitting.\"),mdx(\"pre\",null,mdx(\"code\",n({parentName:\"pre\"},{className:\"language-go\"}),`func StringSplit(s string) []string {\n    return strings.Split(s, \",\")\n}\n\nfunc CheckedEmptyStringSplit(s string) []string {\n    if len(s) == 0 {\n        return []string{}\n    }\n\n    return StringSplit(s)\n}\n\nfunc main() {\n    s := \"\"\n    fmt.Println(len(StringSplit(s))) // prints 1\n    fmt.Println(len(CheckedEmptyStringSplit(s))) // prints 0\n}\n`)),mdx(\"h3\",null,\"Wrapping errors while checking with errors.Is\"),mdx(\"p\",null,\"Somewhere down the line of the function stack, we got an error and how can we check the error type compared to exceptions in other programming languages? To check if the returned is of any type, we can wrap the error with custom error type and message and the calling function can check it with \",mdx(\"em\",{parentName:\"p\"},\"errors.Is\"),\". This is very useful to trace back the error and people usually send string literals without wrapping those as errors.\"),mdx(\"p\",null,\"Also, treating errors as strings and comparing strings should be avoided instead use \",mdx(\"em\",{parentName:\"p\"},\"errors.Is\"),\".\"),mdx(\"h3\",null,\"Uninitializing the Map and Structs\"),mdx(\"p\",null,`This is a very serious problem in Go. Sometimes we forget to initialize the map and that leads to runtime errors and the program to panic leading it to crash. The zero value of the map or struct is nil\nIn Go, if you declare a map without initializing it, its zero value will be nil, and any further operations on this map raise run time panic because the `,mdx(\"em\",{parentName:\"p\"},\"nil\"),\" map has not allocated any memory.\"),mdx(\"p\",null,\"The same can be applied when we use a pointer struct if not initialized.\"),mdx(\"pre\",null,mdx(\"code\",n({parentName:\"pre\"},{className:\"language-go\"}),`type intPC interface {\n    PrintContents()\n}\n\ntype st struct {}\n\nfunc (s *st) PrintContents() {}\n\nfunc F(i intPC) {\n    i.PrintContents() // panics here\n}\n\nfunc main() {\n    var s *st\n    F(s)\n}\n`)),mdx(\"p\",null,\"The above program compiles but panics as we have passed the struct pointer that is not pointing to any memory and its value is \",mdx(\"em\",{parentName:\"p\"},\"nil\"),\".\"),mdx(\"h3\",null,\"Nil Interfaces or Pointers\"),mdx(\"p\",null,\"This is the same as the above problem that will lead to panic and program crashes. An interface value is \",mdx(\"em\",{parentName:\"p\"},\"nil\"),\" if its value and dynamic type are \",mdx(\"em\",{parentName:\"p\"},\"nil\")),mdx(\"pre\",null,mdx(\"code\",n({parentName:\"pre\"},{className:\"language-go\"}),`type intPC interface {\n    PrintContents()\n}\n\nfunc F(i intPC) {\n    fmt.Printf(\"type %T, value %v\\\\n\", i, i) // prints \"type <nil>, value <nil>\"\n    i.PrintContents() // panics here\n}\n\nfunc main() {\n    var i intPC\n    F(i)\n}\n`)),mdx(\"p\",null,\"This is a classic example of nil-interface in Go, here the interface variable is not initialized with any concrete type (struct or int) and also not initialized with any memory. So, it's a nil-interface and we can't perform any operations on it. Avoid these types of nil types using proper checks.\"),mdx(\"h3\",null,\"JSON un-marshalling for integer to an interface will be float64\"),mdx(\"p\",null,\"While un-marshaling the JSON string into an \",mdx(\"em\",{parentName:\"p\"},\"interface{}\"),\", the numeric values like int are parsed as float64.\"),mdx(\"pre\",null,mdx(\"code\",n({parentName:\"pre\"},{className:\"language-go\"}),`func main() {\n    jsS := \\`{\"a\": 10}\\`\n\n    m := map[string]interface{}{}\n\n    json.Unmarshal([]byte(jsS), &m)\n\n    fmt.Printf(\"%T\", m[\"a\"]) // float64\n}\n`)),mdx(\"p\",null,\"Use \",mdx(\"em\",{parentName:\"p\"},\"json.UseNumber()\"),\" with a custom decoder for parsing numbers in JSON as numbers in Go.\"),mdx(\"h3\",null,\"Un-used function parameters\"),mdx(\"p\",null,\"As strict as the Go compiler for unused declared variables, it will ignore any function arguments that are not used. This may not be a problem but what if you are passing a huge chunk of data between functions that are not used anywhere creating the memory overhead? If you want to satisfy the interface for that method and there is no use for that argument, simply ignore it with blank identifier \",mdx(\"em\",{parentName:\"p\"},\"_\"),\".\"),mdx(\"pre\",null,mdx(\"code\",n({parentName:\"pre\"},{className:\"language-go\"}),`func F(param1 int, _ string) {\n    ...\n}\n`)),mdx(\"h3\",null,\"Using pointers in channels\"),mdx(\"p\",null,\"Passing pointer variables in the channel may create data race conditions as both the sender and receiver hold the reference and any one of them can modify. \"),mdx(\"p\",null,\"Also passing pointers reduce memory overhead by eliminating copying and moving. So, we have to be careful when passing pointers into the channels. The Receiver should not alter the data that it receives as it is only allowed to consume the data. So, avoid data modification at the receiver side.\"),mdx(\"h3\",null,\"Receiving in closed channel results in zero value of the channel type\"),mdx(\"p\",null,\"If you try to receive from a closed channel, you will get the zero value of the channel type creating confusion that the sender is still sending.\"),mdx(\"pre\",null,mdx(\"code\",n({parentName:\"pre\"},{className:\"language-go\"}),`func main() {\n    ch := make(chan int)\n    close(ch)\n\n    fmt.Println(<-ch) // 0\n}\n`)),mdx(\"p\",null,\"To avoid this, either check if the channel is closed by checking if the data received is sent by the channel or not as \"),mdx(\"pre\",null,mdx(\"code\",n({parentName:\"pre\"},{className:\"language-go\"}),`func main() {\n    ch := make(chan int)\n    close(ch)\n\n    d, ok := <-ch\n    if !ok {\n        fmt.Println(\"channel closed\")\n    } else {\n        fmt.Println(d)\n    }\n}\n`)),mdx(\"h3\",null,\"Some other tips\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"There are no restrictions on interface declaration, it's better to have interface declaration at the client side or at the location where the package is being used. This limits the third-party packages from accessing the whole struct/data. \"),mdx(\"li\",{parentName:\"ul\"},\"Don't exploit the \",mdx(\"em\",{parentName:\"li\"},\"Duck typing\"),\" of interfaces and structs in Go. Limit the size of the interface and use multiple interfaces for each set of functions.\"),mdx(\"li\",{parentName:\"ul\"},\"Even though it is not mandatory to close the channels, it's still best practice to close them as it might free up some memory.\"),mdx(\"li\",{parentName:\"ul\"},\"Use uni-directional channels instead of bi-directional because uni-directional channels restrict the function to either send or receive but not both creating some form of check. \"),mdx(\"li\",{parentName:\"ul\"},\"Buffer channels will block sending/reading, so use buffer channels to make multiple goroutines work as a synchronous function or communicate with these buffer channels.\"),mdx(\"li\",{parentName:\"ul\"},\"Mutexes are slow, so use RWMutex which may be fast for reads at least.\"),mdx(\"li\",{parentName:\"ul\"},\"Passing large data as an argument to function involves copying and creating the new data. Use pointers and don't modify the data in the called function.\")),mdx(\"hr\",null),mdx(\"p\",null,\"These are some of the common mistakes we make in Go and also good practices that I felt worth sharing. Also check out my previous article on \",mdx(\"a\",n({parentName:\"p\"},{href:\"https://santhalakshminarayana.github.io/blog/advanced-golang-memory-model-concurrency\"}),\"Advanced Go\"),\" about memory model and concurrency in Go.\"),mdx(\"h3\",null,\"References\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",n({parentName:\"li\"},{href:\"https://go.dev/wiki/ExperienceReports\"}),\"https://go.dev/wiki/ExperienceReports\"))))}MDXContent.isMDXComponent=!0;\n","scope":{}},"id":"go-gotchas-and-good-practices"},"__N_SSG":true}